// Lab_03_1.cpp
// < Кобринович, Богдан >
// Лабораторна робота № 3.1
// Розгалуження, задане формулою: функція однієї змінної.
// Варіант 0.9

#include <iostream>
#include <cmath>

using namespace std;

int main() {

    double x; // вхідний результат
    double y; // результат обчислення
    double A; // проміжний результат - функціонально стала частина виразу
    double B; // проміжний результат - функціонально змінна частина виразу

    cout << "x = ";
    cin >> x;

    A = 2 * pow(fabs(x), 3);

    // спосіб 1: розгалуження в скороченій формі
    if (x <= -0.1)
        B = 5 * cos(18 * x);

    if (x > -0.1 && x < 1.2)
        B = atan((x + 2.0) / 5.0);

    if (x >= 1.2)
        B = 1.0 / tan(x) + 18;

    y = A - B;

    cout << "1) y = " << y << endl;

    // спосіб 2: розгалуження в повній формі
    if (x <= -0.1)
        B = 5 * cos(18 * x);
    else if (x > -0.1 && x < 1.2)
        B = atan((x + 2.0) / 5.0);
    else
        B = 1.0 / tan(x) + 18;

    y = A - B;

    cout << "2) y = " << y << endl;

    return 0;
}